[
  {
    "image": "https://i.ibb.co.com/pjJBMzgS/todo.jpg",
    "title": "Todoist – Task Management",
    "companyName": "FlowLabs Inc.",
    "id": 1,
    "description": "Todoist is a comprehensive task management and productivity tool designed for individuals and teams of all sizes. It allows users to create projects, tasks, and sub-tasks with customizable labels, priorities, and deadlines. You can visualize your workflow with Kanban-style boards or list views, integrate seamlessly with emails, calendars, and third-party apps like Slack, Google Calendar, and Dropbox. Todoist also includes collaborative features such as shared projects, team comments, real-time notifications, and productivity reports to track progress and performance over time. Its AI-powered suggestions can help optimize schedules and reminders, and users can benefit from habit tracking, recurring tasks, and goal-setting functionalities. The app supports offline access, cross-device syncing, and provides advanced filtering options to focus on the most critical tasks, making it suitable for both personal and professional use, whether managing daily chores or large-scale project management in enterprises.",
    "size": 42,
    "reviews": 2456,
    "ratingAvg": 4.5,
    "downloads": 120000,
    "ratings": [
      { "name": "1 star", "count": 120 },
      { "name": "2 star", "count": 230 },
      { "name": "3 star", "count": 480 },
      { "name": "4 star", "count": 720 },
      { "name": "5 star", "count": 906 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/TB7nQ6pW/SmPlan.png",
    "title": "SmPlan – To-Do & Reminders",
    "companyName": "VitalTech",
    "id": 2,
    "description": "SmPlan is an all-in-one productivity and planning app that helps users organize their daily routines, tasks, and reminders efficiently. The app offers a clean, intuitive interface for creating to-do lists, categorizing tasks, setting deadlines, and assigning priorities. SmPlan includes smart notifications, recurring task management, and the ability to integrate tasks with external calendars for a seamless workflow. It also provides analytics and performance tracking, allowing users to monitor their progress, identify bottlenecks, and optimize their daily schedules. The app supports collaborative features for team planning, including shared task lists, comment threads, and real-time updates. With customizable themes, color-coding, and flexible layouts, SmPlan ensures users can tailor their productivity system to their personal or professional needs, making it ideal for students, professionals, and teams who want to maximize efficiency.",
    "size": 58,
    "reviews": 3870,
    "ratingAvg": 4.3,
    "downloads": 18277,
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 410 },
      { "name": "3 star", "count": 620 },
      { "name": "4 star", "count": 980 },
      { "name": "5 star", "count": 1560 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/4Zqv0tkf/Timer.png",
    "title": "FLIP – Focus Timer",
    "companyName": "PaperCloud",
    "id": 3,
    "description": "FLIP is a minimalistic yet highly effective focus timer app designed to improve concentration, productivity, and time management for students, professionals, and anyone looking to structure their work sessions. Using the Pomodoro technique or custom interval timers, users can set focused work periods followed by breaks, track the number of completed sessions, and gain insights into their productivity patterns. FLIP offers visual and audio cues, detailed session statistics, and progress tracking to motivate users to stay on task. Its clean design reduces distractions, and the app allows customization of timer lengths, alerts, and themes to match personal preferences. FLIP also includes goal-setting features, historical data, and performance reports to help users understand their work habits, optimize focus periods, and achieve a sustainable, productive workflow over time.",
    "size": 24,
    "reviews": 1320,
    "ratingAvg": 4.7,
    "downloads": 9827,
    "ratings": [
      { "name": "1 star", "count": 45 },
      { "name": "2 star", "count": 90 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 380 },
      { "name": "5 star", "count": 655 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/SXQzBYjf/Headspace.png",
    "title": "Headspace – Meditation",
    "companyName": "DevNest",
    "id": 4,
    "description": "Headspace is a leading meditation and mindfulness app that offers guided meditation sessions, breathing exercises, sleep aids, and mental wellness tools to help users reduce stress, improve focus, and enhance overall well-being. The app provides programs for beginners and advanced meditators, covering topics such as anxiety management, emotional balance, stress relief, and personal growth. Headspace integrates educational content, daily mindfulness exercises, and visualizations to teach users how to meditate effectively. It also offers sleep stories, ambient sounds, and relaxation techniques to improve sleep quality. The app tracks user progress, provides reminders to meditate, and includes personalized suggestions to build long-term mental wellness habits, making it suitable for individuals and teams looking to enhance productivity and mental resilience.",
    "size": 96,
    "reviews": 5120,
    "ratingAvg": 4.6,
    "downloads": 9027,
    "ratings": [
      { "name": "1 star", "count": 180 },
      { "name": "2 star", "count": 270 },
      { "name": "3 star", "count": 680 },
      { "name": "4 star", "count": 1450 },
      { "name": "5 star", "count": 2540 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/4g4tXQWs/Pomodoro.jpg",
    "title": "Pomodoro Timer – Productivity",
    "companyName": "CalmWave Studio",
    "id": 5,
    "description": "Pomodoro Timer is a professional time management tool that helps users structure work and break intervals using the Pomodoro Technique. It allows customizable work durations, short and long breaks, and session goals, helping users maintain focus, avoid burnout, and increase productivity. Users can track completed Pomodoros, review historical productivity trends, and receive reminders and alerts to stay on schedule. The app features a distraction-free interface, sound notifications, visual timers, and reporting dashboards to analyze performance over time. Suitable for students, freelancers, and teams, Pomodoro Timer supports habit building, goal tracking, and productivity insights that make working smarter and maintaining consistent workflow easy and effective.",
    "size": 65,
    "reviews": 6230,
    "ratingAvg": 4.8,
    "downloads": 1876,
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 180 },
      { "name": "3 star", "count": 320 },
      { "name": "4 star", "count": 1100 },
      { "name": "5 star", "count": 4430 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/ZjXP9Yc/Alarmy.jpg",
    "title": "Alarmy – Alarm Clock",
    "companyName": "MarketX",
    "id": 6,
    "description": "Alarmy is a highly customizable alarm clock app designed to wake users effectively using multiple alarm modes, sleep tracking, and reminders. The app includes innovative wake-up challenges like solving math problems, shaking the phone, or scanning barcodes to ensure you get out of bed. Users can set multiple alarms, create recurring schedules, and monitor sleep quality with integrated tracking features. Alarmy also provides gentle wake-up options, sound libraries, and snooze control to tailor the experience. Its detailed statistics, reminders, and task integration help users build healthy sleep routines, manage daily schedules, and increase morning productivity, making it suitable for heavy sleepers and productivity enthusiasts.",
    "size": 74,
    "reviews": 2140,
    "ratingAvg": 4.2,
    "downloads": 987654,
    "ratings": [
      { "name": "1 star", "count": 240 },
      { "name": "2 star", "count": 320 },
      { "name": "3 star", "count": 460 },
      { "name": "4 star", "count": 620 },
      { "name": "5 star", "count": 500 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/939tYLJV/Routine.jpg",
    "title": "Morning Habits – Daily Routine",
    "companyName": "NomadSoft",
    "id": 7,
    "description": "Morning Habits is a comprehensive daily routine planner and habit tracker that helps users establish productive routines, monitor consistency, and achieve personal goals. Users can schedule morning, afternoon, and evening tasks, set reminders, and track habits visually using calendars, charts, and streaks. The app encourages goal setting, habit building, and mindfulness practices while providing motivational notifications and analytics to review progress. With an intuitive interface and personalized recommendations, Morning Habits is ideal for individuals seeking to optimize their day, develop effective habits, reduce procrastination, and maintain a structured and fulfilling lifestyle.",
    "size": 88,
    "reviews": 3980,
    "ratingAvg": 4.4,
    "downloads": 34567,
    "ratings": [
      { "name": "1 star", "count": 280 },
      { "name": "2 star", "count": 370 },
      { "name": "3 star", "count": 690 },
      { "name": "4 star", "count": 1050 },
      { "name": "5 star", "count": 1590 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/PZQxvvXB/Duolingo.png",
    "title": "Duolingo – Language Learning",
    "companyName": "BudgetEase",
    "id": 8,
    "description": "Duolingo is a highly engaging language learning app that offers structured lessons, interactive exercises, and gamified learning experiences. Users can learn new languages through listening, reading, writing, and speaking exercises while tracking progress with personalized skill trees, daily streaks, and achievement badges. The app includes practice for grammar, vocabulary, and conversation skills, with adaptive learning algorithms that adjust difficulty based on user performance. Duolingo supports dozens of languages, integrates with external learning tools, and provides real-time feedback and challenges to reinforce learning. Its fun, game-like environment keeps learners motivated, making it suitable for students, travelers, professionals, and anyone seeking consistent language practice.",
    "size": 37,
    "reviews": 1890,
    "ratingAvg": 4.6,
    "downloads": 9876543,
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 140 },
      { "name": "3 star", "count": 260 },
      { "name": "4 star", "count": 580 },
      { "name": "5 star", "count": 820 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dwgvQ2HD/Trello.png",
    "title": "Trello – Project Management",
    "companyName": "SnapForge",
    "id": 9,
    "description": "Trello is a flexible project management and collaboration tool that uses boards, lists, and cards to organize tasks, projects, and workflows. Users can assign tasks, set deadlines, add attachments, and collaborate with team members in real-time. Trello integrates with popular tools like Slack, Google Drive, and Jira, allowing seamless workflow automation. The app supports advanced features such as labels, checklists, power-ups, and templates for various project types. With visual boards and detailed tracking, Trello makes managing complex projects, agile workflows, or personal tasks easy and effective, helping teams enhance productivity, transparency, and accountability across projects of all sizes.",
    "size": 83,
    "reviews": 8410,
    "ratingAvg": 4.1,
    "downloads": 654356,
    "ratings": [
      { "name": "1 star", "count": 820 },
      { "name": "2 star", "count": 970 },
      { "name": "3 star", "count": 1630 },
      { "name": "4 star", "count": 2120 },
      { "name": "5 star", "count": 2870 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/WNTRJY9k/Good-Notes.jpg",
    "title": "GoodNotes – Note-Taking",
    "companyName": "CareSync",
    "id": 10,
    "description": "GoodNotes is a powerful note-taking app that allows users to create, organize, and sync handwritten and typed notes across multiple devices. The app supports PDFs, images, and rich text, offering annotation, highlighting, and drawing tools for maximum flexibility. GoodNotes provides notebooks, folders, and customizable templates to structure notes efficiently. Its search functionality, tagging system, and cloud sync features enable easy retrieval and collaboration. Ideal for students, professionals, and creatives, GoodNotes enhances productivity by combining digital organization with the natural feel of handwriting, enabling effective study, research, or project documentation workflows.",
    "size": 49,
    "reviews": 2760,
    "ratingAvg": 4.5,
    "downloads": 87654,
    "ratings": [
      { "name": "1 star", "count": 180 },
      { "name": "2 star", "count": 260 },
      { "name": "3 star", "count": 410 },
      { "name": "4 star", "count": 890 },
      { "name": "5 star", "count": 1020 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Kc5mfyGJ/MindNode.png",
    "title": "MindNode – Mind Mapping",
    "companyName": "Learnify",
    "id": 11,
    "description": "MindNode is a creative mind mapping and brainstorming tool that helps users visualize ideas, organize thoughts, and plan projects effectively. With intuitive node-based diagrams, customizable themes, and hierarchical structuring, MindNode allows users to connect concepts, set priorities, and track progress. The app supports task integration, notes, images, and hyperlinks, making it ideal for planning projects, studying, or organizing information. MindNode also offers cloud syncing, collaboration features, and export options for sharing ideas seamlessly with teams. Its visual approach improves clarity, creativity, and productivity, enabling users to transform complex ideas into structured, actionable plans.",
    "size": 62,
    "reviews": 5630,
    "ratingAvg": 4.7,
    "downloads": 763456,
    "ratings": [
      { "name": "1 star", "count": 160 },
      { "name": "2 star", "count": 220 },
      { "name": "3 star", "count": 500 },
      { "name": "4 star", "count": 1300 },
      { "name": "5 star", "count": 3450 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sdhpf8yF/Music-Verse.jpg",
    "title": "MusicVerse – Music Streaming",
    "companyName": "TuneTech",
    "id": 12,
    "description": "MusicVerse is a full-featured music streaming platform that provides personalized playlists, recommendations, and curated content for every listener. Users can discover new music, explore genres, create custom playlists, and share tracks with friends. The app includes high-quality audio streaming, offline playback, smart search, and integration with social media. MusicVerse also offers mood-based recommendations, top charts, and trending lists to keep listeners engaged. Its collaborative playlists, live radio features, and analytics for personal listening habits enhance the experience for casual users and music enthusiasts alike, making it an all-in-one solution for discovering, listening, and sharing music globally.",
    "size": 79,
    "reviews": 7830,
    "ratingAvg": 4.3,
    "downloads": 3456543,
    "ratings": [
      { "name": "1 star", "count": 640 },
      { "name": "2 star", "count": 810 },
      { "name": "3 star", "count": 1420 },
      { "name": "4 star", "count": 2060 },
      { "name": "5 star", "count": 2900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/KcvnwmhN/NewsNow.png",
    "title": "NewsNow – News Aggregator",
    "companyName": "DailyLoop",
    "id": 13,
    "description": "NewsNow is a comprehensive news aggregator that delivers curated news from trusted sources worldwide. The app offers personalized feeds based on user preferences, breaking news alerts, trending stories, and in-depth coverage of global and local events. Users can filter content by category, region, or topic, save articles for later reading, and share news seamlessly. NewsNow also includes analytics to track reading habits, offline reading mode, and notifications for topics of interest. Its clean, fast interface and algorithmic recommendations ensure users stay informed efficiently, making it suitable for professionals, students, and anyone looking to consume news without distractions.",
    "size": 35,
    "reviews": 4150,
    "ratingAvg": 4.0,
    "downloads": 12321,
    "ratings": [
      { "name": "1 star", "count": 510 },
      { "name": "2 star", "count": 660 },
      { "name": "3 star", "count": 910 },
      { "name": "4 star", "count": 1040 },
      { "name": "5 star", "count": 1030 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/WvQnV8r3/Chatly.png",
    "title": "Chatly – Real-Time Messaging",
    "companyName": "Connectify",
    "id": 14,
    "description": "Chatly is a secure and feature-rich real-time messaging app designed for individuals and teams to communicate efficiently. Users can send text messages, voice notes, images, videos, and documents, as well as create group chats for collaborative discussions. Chatly includes AI-powered smart replies, message search, notifications, message reactions, and status updates. It also offers end-to-end encryption to ensure privacy, multi-device sync, and integration with productivity tools. Chatly enhances collaboration with shared media, task assignment features, and instant communication, making it suitable for work teams, friends, and communities seeking reliable and secure messaging.",
    "size": 52,
    "reviews": 6340,
    "ratingAvg": 4.6,
    "downloads": 87654,
    "ratings": [
      { "name": "1 star", "count": 240 },
      { "name": "2 star", "count": 370 },
      { "name": "3 star", "count": 780 },
      { "name": "4 star", "count": 1410 },
      { "name": "5 star", "count": 3540 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/v2VHwQW/Weatherly.jpg",
    "title": "Weatherly – Weather Forecast",
    "companyName": "SkyCast",
    "id": 15,
    "description": "Weatherly is an advanced weather forecasting app that provides accurate and up-to-date information on temperature, precipitation, wind, humidity, and other weather conditions. Users can access hourly, daily, and weekly forecasts, live radar maps, severe weather alerts, and personalized notifications for their location or any area of interest. The app includes interactive visualizations, climate trends, and predictive analytics to plan outdoor activities or travel. Weatherly integrates with smart devices, provides weather news, and allows sharing forecasts with friends or family. Its intuitive interface, precision, and reliability make it ideal for daily planning, professionals, and anyone who needs real-time weather insights for safety and convenience.",
    "size": 39,
    "reviews": 2980,
    "ratingAvg": 4.4,
    "downloads": 456765,
    "ratings": [
      { "name": "1 star", "count": 190 },
      { "name": "2 star", "count": 260 },
      { "name": "3 star", "count": 470 },
      { "name": "4 star", "count": 890 },
      { "name": "5 star", "count": 1170 }
    ]
  }
]
